Revit 2024 API
RoomFilter.PassesFilter Method
Overload List
Name | Description
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
See Also
RoomFilter Class
RoomFilter Members
Autodesk.Revit.DB.Architecture Namespace